garyPenhook/PIC-Assembler/edc/PIC18F24Q71.PIC
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="APMSTATUSH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMSTATUSH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1DA">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="APMSTATUS" edc:mask="0xff" edc:name="APMSTATUS" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="OPA1" edc:mask="0x1" edc:name="OPA1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="OPA2" edc:mask="0x1" edc:name="OPA2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC1" edc:mask="0x1" edc:name="DAC1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2" edc:mask="0x1" edc:name="DAC2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC3" edc:mask="0x1" edc:name="DAC3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CMP1" edc:mask="0x1" edc:name="CMP1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CMP2" edc:mask="0x1" edc:name="CMP2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ZCD" edc:mask="0x1" edc:name="ZCD" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="APMSTATUS_8" edc:mask="0x1" edc:name="APMSTATUS_8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMSTATUS_9" edc:mask="0x1" edc:name="APMSTATUS_9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMSTATUS_10" edc:mask="0x1" edc:name="APMSTATUS_10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMSTATUS_11" edc:mask="0x1" edc:name="APMSTATUS_11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMSTATUS_12" edc:mask="0x1" edc:name="APMSTATUS_12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMSTATUS_13" edc:mask="0x1" edc:name="APMSTATUS_13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMSTATUS_14" edc:mask="0x1" edc:name="APMSTATUS_14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMSTATUS_15" edc:mask="0x1" edc:name="APMSTATUS_15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:AdjustPoint edc:offset="0x27" edc:_addr="0x1DB"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0x2" edc:beginaddr="0x0200" edc:endaddr="0x0300" edc:regionid="sfr2">
        <edc:SFRDef edc:access="-------n" edc:cname="PPSLOCK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PPSLOCK" edc:nzwidth="8" edc:por="-------0" edc:_addr="0x200">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PPSLOCKED" edc:mask="0x1" edc:name="PPSLOCKED" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RA0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RA0PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x201">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA0PPS0" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS1" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS2" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS3" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS4" edc:mask="0x1" edc:name="RA0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS5" edc:mask="0x1" edc:name="RA0PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RA1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RA1PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x202">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA1PPS0" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS1" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS2" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS3" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS4" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS5" edc:mask="0x1" edc:name="RA1PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RA2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RA2PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x203">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA2PPS0" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS1" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS2" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS3" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS4" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS5" edc:mask="0x1" edc:name="RA2PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RA3PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RA3PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x204">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA3PPS0" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS1" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS2" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS3" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS4" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS5" edc:mask="0x1" edc:name="RA3PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RA4PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RA4PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x205">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA4PPS0" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS1" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS2" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS3" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS4" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS5" edc:mask="0x1" edc:name="RA4PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
