garyPenhook/PIC-Assembler/edc/PIC18F24Q71.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T1GPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T1GPPS" edc:nzwidth="8" edc:por="--001101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x243">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T1GPPS0" edc:mask="0x1" edc:name="T1GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS1" edc:mask="0x1" edc:name="T1GPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS2" edc:mask="0x1" edc:name="T1GPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS3" edc:mask="0x1" edc:name="T1GPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS4" edc:mask="0x1" edc:name="T1GPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS5" edc:mask="0x1" edc:name="T1GPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T1GPPS" edc:mask="0x3f" edc:name="T1GPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T3CKIPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T3CKIPPS" edc:nzwidth="8" edc:por="--010000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x244">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T3CKIPPS0" edc:mask="0x1" edc:name="T3CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS1" edc:mask="0x1" edc:name="T3CKIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS2" edc:mask="0x1" edc:name="T3CKIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS3" edc:mask="0x1" edc:name="T3CKIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS4" edc:mask="0x1" edc:name="T3CKIPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS5" edc:mask="0x1" edc:name="T3CKIPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T3CKIPPS" edc:mask="0x3f" edc:name="T3CKIPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T3GPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T3GPPS" edc:nzwidth="8" edc:por="--010000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x245">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T3GPPS0" edc:mask="0x1" edc:name="T3GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS1" edc:mask="0x1" edc:name="T3GPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS2" edc:mask="0x1" edc:name="T3GPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS3" edc:mask="0x1" edc:name="T3GPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS4" edc:mask="0x1" edc:name="T3GPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS5" edc:mask="0x1" edc:name="T3GPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T3GPPS" edc:mask="0x3f" edc:name="T3GPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x246"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T2INPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T2INPPS" edc:nzwidth="8" edc:por="--010011" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x248">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2INPPS0" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS1" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS2" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS3" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS4" edc:mask="0x1" edc:name="T2INPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS5" edc:mask="0x1" edc:name="T2INPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2INPPS" edc:mask="0x3f" edc:name="T2INPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T4INPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T4INPPS" edc:nzwidth="8" edc:por="--010101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x249">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T4INPPS0" edc:mask="0x1" edc:name="T4INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4INPPS1" edc:mask="0x1" edc:name="T4INPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4INPPS2" edc:mask="0x1" edc:name="T4INPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4INPPS3" edc:mask="0x1" edc:name="T4INPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4INPPS4" edc:mask="0x1" edc:name="T4INPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4INPPS5" edc:mask="0x1" edc:name="T4INPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T4INPPS" edc:mask="0x3f" edc:name="T4INPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
