garyPenhook/PIC-Assembler/edc/PIC18F24Q71.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TUIN1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="TUIN1PPS" edc:nzwidth="8" edc:por="--001101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x279">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TUIN1PPS0" edc:mask="0x1" edc:name="TUIN1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUIN1PPS1" edc:mask="0x1" edc:name="TUIN1PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUIN1PPS2" edc:mask="0x1" edc:name="TUIN1PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUIN1PPS3" edc:mask="0x1" edc:name="TUIN1PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUIN1PPS4" edc:mask="0x1" edc:name="TUIN1PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUIN1PPS5" edc:mask="0x1" edc:name="TUIN1PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TUIN1PPS" edc:mask="0x3f" edc:name="TUIN1PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="APMCLKPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="APMCLKPPS" edc:nzwidth="8" edc:por="--010100" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x27A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="APMCLKPPS0" edc:mask="0x1" edc:name="APMCLKPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="APMCLKPPS1" edc:mask="0x1" edc:name="APMCLKPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="APMCLKPPS2" edc:mask="0x1" edc:name="APMCLKPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="APMCLKPPS3" edc:mask="0x1" edc:name="APMCLKPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="APMCLKPPS4" edc:mask="0x1" edc:name="APMCLKPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="APMCLKPPS5" edc:mask="0x1" edc:name="APMCLKPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="APMCLKPPS" edc:mask="0x3f" edc:name="APMCLKPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0xA" edc:_addr="0x27B"/>
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="RC4I2C" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="RC4I2C" edc:nzwidth="8" edc:por="0000--00" edc:_modsrc="DOS-03989_pad_8bit_i2c_v2.Module" edc:_refcount="1" edc:_begin="0x4" edc:_end="0x8" edc:_addr="0x285">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TH" edc:mask="0x3" edc:name="TH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU" edc:mask="0x3" edc:name="PU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TH0" edc:mask="0x1" edc:name="TH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TH1" edc:mask="0x1" edc:name="TH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU0" edc:mask="0x1" edc:name="PU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PU1" edc:mask="0x1" edc:name="PU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW0" edc:mask="0x1" edc:name="SLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW1" edc:mask="0x1" edc:name="SLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2CTH" edc:mask="0x3" edc:name="I2CTH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU" edc:mask="0x3" edc:name="I2CPU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW" edc:mask="0x3" edc:name="I2CSLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CTH0" edc:mask="0x1" edc:name="I2CTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CTH1" edc:mask="0x1" edc:name="I2CTH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU0" edc:mask="0x1" edc:name="I2CPU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CPU1" edc:mask="0x1" edc:name="I2CPU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW0" edc:mask="0x1" edc:name="I2CSLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW1" edc:mask="0x1" edc:name="I2CSLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="RC3I2C" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="RC3I2C" edc:nzwidth="8" edc:por="0000--00" edc:_modsrc="DOS-03989_pad_8bit_i2c_v2.Module" edc:_refcount="1" edc:_begin="0x4" edc:_end="0x8" edc:_addr="0x286">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TH" edc:mask="0x3" edc:name="TH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU" edc:mask="0x3" edc:name="PU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TH0" edc:mask="0x1" edc:name="TH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TH1" edc:mask="0x1" edc:name="TH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU0" edc:mask="0x1" edc:name="PU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PU1" edc:mask="0x1" edc:name="PU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW0" edc:mask="0x1" edc:name="SLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW1" edc:mask="0x1" edc:name="SLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2CTH" edc:mask="0x3" edc:name="I2CTH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU" edc:mask="0x3" edc:name="I2CPU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW" edc:mask="0x3" edc:name="I2CSLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CTH0" edc:mask="0x1" edc:name="I2CTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CTH1" edc:mask="0x1" edc:name="I2CTH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU0" edc:mask="0x1" edc:name="I2CPU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CPU1" edc:mask="0x1" edc:name="I2CPU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW0" edc:mask="0x1" edc:name="I2CSLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW1" edc:mask="0x1" edc:name="I2CSLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="RB2I2C" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="RB2I2C" edc:nzwidth="8" edc:por="0000--00" edc:_modsrc="DOS-03989_pad_8bit_i2c_v2.Module" edc:_refcount="1" edc:_begin="0x4" edc:_end="0x8" edc:_addr="0x287">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TH" edc:mask="0x3" edc:name="TH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU" edc:mask="0x3" edc:name="PU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TH0" edc:mask="0x1" edc:name="TH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TH1" edc:mask="0x1" edc:name="TH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU0" edc:mask="0x1" edc:name="PU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PU1" edc:mask="0x1" edc:name="PU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW0" edc:mask="0x1" edc:name="SLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW1" edc:mask="0x1" edc:name="SLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2CTH" edc:mask="0x3" edc:name="I2CTH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU" edc:mask="0x3" edc:name="I2CPU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW" edc:mask="0x3" edc:name="I2CSLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CTH0" edc:mask="0x1" edc:name="I2CTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CTH1" edc:mask="0x1" edc:name="I2CTH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU0" edc:mask="0x1" edc:name="I2CPU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CPU1" edc:mask="0x1" edc:name="I2CPU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW0" edc:mask="0x1" edc:name="I2CSLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW1" edc:mask="0x1" edc:name="I2CSLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="RB1I2C" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="RB1I2C" edc:nzwidth="8" edc:por="0000--00" edc:_modsrc="DOS-03989_pad_8bit_i2c_v2.Module" edc:_refcount="1" edc:_begin="0x4" edc:_end="0x8" edc:_addr="0x288">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TH" edc:mask="0x3" edc:name="TH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU" edc:mask="0x3" edc:name="PU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TH0" edc:mask="0x1" edc:name="TH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TH1" edc:mask="0x1" edc:name="TH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU0" edc:mask="0x1" edc:name="PU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PU1" edc:mask="0x1" edc:name="PU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW0" edc:mask="0x1" edc:name="SLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW1" edc:mask="0x1" edc:name="SLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2CTH" edc:mask="0x3" edc:name="I2CTH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU" edc:mask="0x3" edc:name="I2CPU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW" edc:mask="0x3" edc:name="I2CSLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CTH0" edc:mask="0x1" edc:name="I2CTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CTH1" edc:mask="0x1" edc:name="I2CTH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU0" edc:mask="0x1" edc:name="I2CPU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CPU1" edc:mask="0x1" edc:name="I2CPU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW0" edc:mask="0x1" edc:name="I2CSLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW1" edc:mask="0x1" edc:name="I2CSLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="I2C1RXB" edc:desc="I2C RECEIVE BUFFER REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="I2C1RXB" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x289">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB" edc:desc="" edc:mask="0xff" edc:name="RXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="I2C1TXB" edc:desc="I2C TRANSMIT BUFFER REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="I2C1TXB" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x28A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB" edc:desc="" edc:mask="0xff" edc:name="TXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="I2C1CNT" edc:desc="" edc:name="I2C1CNT" edc:nzwidth="0x10" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x28B">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1CNTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C1CNTL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x28B">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CNT" edc:mask="0xff" edc:name="CNT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="CNT0" edc:mask="0x1" edc:name="CNT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT1" edc:mask="0x1" edc:name="CNT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT2" edc:mask="0x1" edc:name="CNT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT3" edc:mask="0x1" edc:name="CNT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT4" edc:mask="0x1" edc:name="CNT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT5" edc:mask="0x1" edc:name="CNT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT6" edc:mask="0x1" edc:name="CNT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT7" edc:mask="0x1" edc:name="CNT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="I2C1CNT" edc:mask="0xff" edc:name="I2C1CNT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="I2C1CNT0" edc:mask="0x1" edc:name="I2C1CNT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT1" edc:mask="0x1" edc:name="I2C1CNT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT2" edc:mask="0x1" edc:name="I2C1CNT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT3" edc:mask="0x1" edc:name="I2C1CNT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT4" edc:mask="0x1" edc:name="I2C1CNT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT5" edc:mask="0x1" edc:name="I2C1CNT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT6" edc:mask="0x1" edc:name="I2C1CNT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT7" edc:mask="0x1" edc:name="I2C1CNT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1CNTH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C1CNTH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x28C">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CNT" edc:mask="0xff" edc:name="CNT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="CNT8" edc:mask="0x1" edc:name="CNT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT9" edc:mask="0x1" edc:name="CNT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT10" edc:mask="0x1" edc:name="CNT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT11" edc:mask="0x1" edc:name="CNT11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT12" edc:mask="0x1" edc:name="CNT12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT13" edc:mask="0x1" edc:name="CNT13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT14" edc:mask="0x1" edc:name="CNT14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT15" edc:mask="0x1" edc:name="CNT15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="I2C1CNT" edc:mask="0xff" edc:name="I2C1CNT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="I2C1CNT8" edc:mask="0x1" edc:name="I2C1CNT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT9" edc:mask="0x1" edc:name="I2C1CNT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT10" edc:mask="0x1" edc:name="I2C1CNT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT11" edc:mask="0x1" edc:name="I2C1CNT11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT12" edc:mask="0x1" edc:name="I2C1CNT12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT13" edc:mask="0x1" edc:name="I2C1CNT13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT14" edc:mask="0x1" edc:name="I2C1CNT14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT15" edc:mask="0x1" edc:name="I2C1CNT15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
