garyPenhook/PIC-Assembler/edc/PIC18F24Q71.PIC
        <edc:JoinedSFRDef edc:cname="FSR0SH" edc:desc="" edc:name="FSR0SH" edc:nzwidth="0x10" edc:_addr="0x37C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR0SH" edc:desc="" edc:mask="0x3fff" edc:name="FSR0SH" edc:nzwidth="0xE"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR0L_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="00000000" edc:name="FSR0L_SHAD" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x37C">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR0L" edc:desc="" edc:mask="0xff" edc:name="FSR0L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="FSR0H_SHAD" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--000000" edc:name="FSR0H_SHAD" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x37D">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR0H" edc:mask="0x3f" edc:name="FSR0H" edc:nzwidth="0x6"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="FSR1SH" edc:desc="" edc:name="FSR1SH" edc:nzwidth="0x10" edc:_addr="0x37E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR1SH" edc:desc="" edc:mask="0x3fff" edc:name="FSR1SH" edc:nzwidth="0xE"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR1L_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="00000000" edc:name="FSR1L_SHAD" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x37E">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR1L" edc:desc="" edc:mask="0xff" edc:name="FSR1L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="FSR1H_SHAD" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--000000" edc:name="FSR1H_SHAD" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x37F">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR1H" edc:mask="0x3f" edc:name="FSR1H" edc:nzwidth="0x6"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="FSR2SH" edc:desc="" edc:name="FSR2SH" edc:nzwidth="0x10" edc:_addr="0x380">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR2SH" edc:desc="" edc:mask="0x3fff" edc:name="FSR2SH" edc:nzwidth="0xE"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR2L_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="00000000" edc:name="FSR2L_SHAD" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x380">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR2L" edc:desc="" edc:mask="0xff" edc:name="FSR2L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="FSR2H_SHAD" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--000000" edc:name="FSR2H_SHAD" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x381">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR2H" edc:mask="0x3f" edc:name="FSR2H" edc:nzwidth="0x6"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PRODSH" edc:desc="" edc:name="PRODSH" edc:nzwidth="0x10" edc:_addr="0x382">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PROD" edc:desc="" edc:mask="0xffff" edc:name="PROD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PRODL_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuu" edc:name="PRODL_SHAD" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x382">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRODL" edc:desc="" edc:mask="0xff" edc:name="PRODL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PRODH_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuu" edc:name="PRODH_SHAD" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x383">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRODH" edc:desc="" edc:mask="0xff" edc:name="PRODH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:AdjustPoint edc:offset="0x1C" edc:_addr="0x384"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16ACON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16ACON0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03877_tmr_8bit_v1_16bits.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x3A0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CIE" edc:desc="" edc:mask="0x1" edc:name="CIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ZIE" edc:desc="" edc:mask="0x1" edc:name="ZIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PRIE" edc:desc="" edc:mask="0x1" edc:name="PRIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDSEL" edc:desc="" edc:mask="0x1" edc:name="RDSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPOL" edc:desc="" edc:mask="0x1" edc:name="OPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OM" edc:desc="" edc:mask="0x1" edc:name="OM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPOL" edc:desc="" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TU16ACIE" edc:desc="" edc:mask="0x1" edc:name="TU16ACIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU16AZIE" edc:desc="" edc:mask="0x1" edc:name="TU16AZIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU16APRIE" edc:mask="0x1" edc:name="TU16APRIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ARDSEL" edc:desc="" edc:mask="0x1" edc:name="TU16ARDSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU16AOPOL" edc:mask="0x1" edc:name="TU16AOPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AOM" edc:mask="0x1" edc:name="TU16AOM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ACPOL" edc:mask="0x1" edc:name="TU16ACPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AON" edc:mask="0x1" edc:name="TU16AON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnnnnnn" edc:cname="TU16ACON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16ACON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03877_tmr_8bit_v1_16bits.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x3A1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CIF" edc:desc="" edc:mask="0x1" edc:name="CIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ZIF" edc:desc="" edc:mask="0x1" edc:name="ZIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PRIF" edc:desc="" edc:mask="0x1" edc:name="PRIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CAPT" edc:desc="" edc:mask="0x1" edc:name="CAPT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LIMIT" edc:mask="0x1" edc:name="LIMIT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLR" edc:desc="" edc:mask="0x1" edc:name="CLR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSEN" edc:desc="" edc:mask="0x1" edc:name="OSEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RUN" edc:desc="" edc:mask="0x1" edc:name="RUN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TU16ACIF" edc:mask="0x1" edc:name="TU16ACIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AZIF" edc:mask="0x1" edc:name="TU16AZIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16APRIF" edc:mask="0x1" edc:name="TU16APRIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ACAPT" edc:mask="0x1" edc:name="TU16ACAPT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ALIMIT" edc:mask="0x1" edc:name="TU16ALIMIT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ACLR" edc:desc="" edc:mask="0x1" edc:name="TU16ACLR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMRAOSEN" edc:desc="" edc:mask="0x1" edc:name="TMRAOSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU16ARUN" edc:desc="" edc:mask="0x1" edc:name="TU16ARUN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
